{
  "people": [
    {
      "fullName": "Katy Perry",
      "twitter": {
        "handle": "@katyperry",
        "tcId": "21447363"
      },
      "wikipedia": {
        "extract": "Katheryn Elizabeth Hudson (born October 25, 1984), better known by her stage name Katy Perry, is an American singer, songwriter and occasional actress. She had limited exposure to secular music during her childhood and pursued a career in gospel music as a teenager. Perry signed with Red Hill Records, and released her debut studio album, Katy Hudson, in 2001. She moved to Los Angeles the following year to venture into secular music. After being dropped by The Island Def Jam Music Group and Columbia Records, she signed a deal with Capitol Records in April 2007.\nPerry rose to fame in 2008 with the release of the singles \"I Kissed a Girl\" – which had attention-grabbing and somewhat controversial lyrics – and \"Hot n Cold\" from her second album, a pop rock record titled One of the Boys. Her third album, Teenage Dream (2010), ventured into disco, and contained the U.S. Billboard Hot 100 chart-topping singles \"California Gurls\", \"Teenage Dream\", \"Firework\", \"E.T.\", and \"Last Friday Night (T.G.I.F.)\" as well as the number-three single \"The One That Got Away\". The album became the first by a female artist to produce five number-one Billboard Hot 100 songs, and the second overall after Michael Jackson's album Bad (1987). In March 2012, she reissued the album as Teenage Dream: The Complete Confection, which produced the chart-topping singles \"Part of Me\" and \"Wide Awake\".\nHer fourth album, Prism, was released in 2013, and is influenced by pop and dance. It has spawned the number-one singles \"Roar\" and \"Dark Horse\". Her songwriting is mostly done in collaboration with others, especially Dr. Luke and Max Martin, and in songs such as \"Firework\" and \"Roar\" she stresses themes of self-empowerment and self-esteem. Perry is known for an idiosyncratic and fun-based sense of personal fashion that incorporates bright colors and food-based themes. Her concert performances feature elaborate stagings and costumings.\nPerry has received many awards, including three Guinness World Records, and been included in the Forbes list of \"Top-Earning Women In Music\" for 2011, 2012, and 2013. Throughout her career, she has sold 11 million albums and 81 million singles worldwide, making her one of the best-selling artists of all time. Perry has also made celebrity endorsements and released perfumes Purr, Meow!, and Killer Queen. In July 2012, she released an autobiographical documentary titled Katy Perry: Part of Me, which concentrated on her life as a touring artist and the dissolution of her brief marriage to English actor and comedian Russell Brand in the early 2010s."
      }
    },
    {
      "fullName": "Justin Bieber",
      "twitter": {
        "handle": "@justinbieber",
        "tcId": "27260086"
      },
      "wikipedia": {
        "extract": "Justin Drew Bieber (/ˈbiːbər/; born March 1, 1994) is a Canadian singer and songwriter. Bieber's current manager, Scooter Braun first discovered him through his YouTube videos in 2007. Braun was impressed with the videos, and contacted Bieber's mother Pattie about wanting to work with him. Having convinced Bieber's mother, Braun arranged for Bieber to meet with Usher in Atlanta, Georgia. Bieber was signed to RBMG, and then to an Island Records recording contract offered by record executive, L.A. Reid.\nBieber released his debut EP, My World, in November 2009. It was certified platinum in the United States. He became the first artist to have seven songs from a debut record to chart on the Billboard Hot 100. Bieber released his first full-length studio album, My World 2.0, in March 2010. It debuted at or near number one in several countries and was certified platinum in the United States. It was preceded by the single \"Baby\", which is also, as of July 2014, the YouTube video with the most dislikes, and the most views on a Vevo platform. He followed up the release of his debut album with his first headlining tour, the My World Tour, the remix albums My Worlds Acoustic and Never Say Never – The Remixes, and the 3D biopic-concert film Justin Bieber: Never Say Never. Bieber released his second studio album Under the Mistletoe in November 2011, when it debuted at number one on the Billboard 200. Bieber released his third studio album Believe in June 2012. It became his fourth chart topper in the United States, debuting at number-one on the Billboard 200.\nBieber has received numerous industry awards, including both Artist of the Year Awards, at the 2010 American Music Awards, and the 2012 American Music Awards, and was nominated for Best New Artist and Best Pop Vocal Album at the 53rd Grammy Awards. With a global fan base, termed as \"Beliebers\", and over 60 million followers on Twitter, Bieber was twice named by Forbes magazine as one of the top ten most powerful celebrities in the world, ranking third in both 2011 and 2012, and ranking ninth in 2013."
      }
    },
    {
      "fullName": "Barack Obama",
      "twitter": {
        "handle": "@BarackObama",
        "tcId": "813286"
      },
      "wikipedia": {
        "extract": "Barack Hussein Obama II (US /bəˈrɑːk huːˈseɪn ɵˈbɑːmə/, born August 4, 1961) is the 44th and current President of the United States, and the first African American to hold the office. Born in Honolulu, Hawaii, Obama is a graduate of Columbia University and Harvard Law School, where he served as president of the Harvard Law Review. He was a community organizer in Chicago before earning his law degree. He worked as a civil rights attorney and taught constitutional law at the University of Chicago Law School from 1992 to 2004. He served three terms representing the 13th District in the Illinois Senate from 1997 to 2004, running unsuccessfully for the United States House of Representatives in 2000.\nIn 2004, Obama received national attention during his campaign to represent Illinois in the United States Senate with his victory in the March Democratic Party primary, his keynote address at the Democratic National Convention in July, and his election to the Senate in November. He began his presidential campaign in 2007 and, after a close primary campaign against Hillary Rodham Clinton in 2008, he won sufficient delegates in the Democratic Party primaries to receive the presidential nomination. He then defeated Republican nominee John McCain in the general election, and was inaugurated as president on January 20, 2009. Nine months after his election, Obama was named the 2009 Nobel Peace Prize laureate.\nDuring his first two years in office, Obama signed into law economic stimulus legislation in response to the Great Recession in the form of the American Recovery and Reinvestment Act of 2009 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010. Other major domestic initiatives in his first term included the Patient Protection and Affordable Care Act, often referred to as \"Obamacare\"; the Dodd–Frank Wall Street Reform and Consumer Protection Act; and the Don't Ask, Don't Tell Repeal Act of 2010. In foreign policy, Obama ended U.S. military involvement in the Iraq War, increased U.S. troop levels in Afghanistan, signed the New START arms control treaty with Russia, ordered U.S. military involvement in Libya, and ordered the military operation that resulted in the death of Osama bin Laden. In January 2011, the Republicans regained control of the House of Representatives as the Democratic Party lost a total of 63 seats; and, after a lengthy debate over federal spending and whether or not to raise the nation's debt limit, Obama signed the Budget Control Act of 2011 and the American Taxpayer Relief Act of 2012.\nObama was reelected president in November 2012, defeating Republican nominee Mitt Romney, and was sworn in for a second term on January 20, 2013. During his second term, Obama has promoted domestic policies related to gun control in response to the Sandy Hook Elementary School shooting, and has called for full equality for LGBT Americans, while his administration has filed briefs which urged the Supreme Court to strike down the Defense of Marriage Act of 1996 and California's Proposition 8 as unconstitutional. In foreign policy, Obama ordered U.S. military involvement in Iraq in response to gains made by the Islamic State in Iraq after the 2011 withdrawal from Iraq, continued the process of ending U.S. combat operations in Afghanistan, and has sought to normalize U.S. relations with Cuba."
      }
    },
    {
      "fullName": "Taylor Swift",
      "twitter": {
        "handle": "@taylorswift13",
        "tcId": "17919972"
      },
      "wikipedia": {
        "extract": "Taylor Alison Swift (born December 13, 1989) is an American singer-songwriter and actress. Raised in Wyomissing, Pennsylvania, Swift moved to Nashville, Tennessee, at the age of 14 to pursue a career in country music. She signed with the independent label Big Machine Records and became the youngest songwriter ever hired by the Sony/ATV Music publishing house. The release of Swift's self-titled debut album in 2006 established her as a country music star. Her third single, \"Our Song,\" made her the youngest person to single-handedly write and perform a number-one song on the Hot Country Songs chart. She received a Best New Artist nomination at the 2008 Grammy Awards.\nSwift's second album, Fearless, was released in 2008. Buoyed by the pop crossover success of the singles \"Love Story\" and \"You Belong with Me,\" Fearless became the best-selling album of 2009 in the United States. The album won four Grammy Awards, with Swift becoming the youngest ever Album of the Year winner. Swift's third and fourth albums, 2010's Speak Now and 2012's Red, both sold over one million copies within the first week of their U.S release. Speak Now won two Grammy Awards, while Red's singles \"We Are Never Ever Getting Back Together\" and \"I Knew You Were Trouble\" were worldwide hits. Swift's fifth album, the pop-focused 1989, was released in 2014. It sold more copies in its opening week than any album in the previous 12 years, and made Swift the first and only act to have three albums sell more than one million copies in the opening release week. The singles \"Shake It Off\" and \"Blank Space\" both reached number one on the Billboard Hot 100.\nSwift is known for narrative songs about her personal experiences. As a songwriter, she has been honored by the Nashville Songwriters Association and the Songwriters Hall of Fame. Swift's other achievements include seven Grammy Awards, twelve Billboard Music Awards, eleven Country Music Association Awards, seven Academy of Country Music Awards and one Brit Award. She is one of the best-selling artists of all time, having sold over 40 million albums—27.1 million of them in the U.S.—and 100 million single downloads.\nIn addition to her music career, Swift has appeared as an actress in the ensemble comedy Valentine's Day (2010), the animated film The Lorax (2012) and The Giver (2014). As a philanthropist, Swift supports arts education, children's literacy, natural disaster relief, LGBT anti-discrimination activities and charities for sick children."
      }
    },
    {
      "fullName": "Lady Gaga",
      "twitter": {
        "handle": "@ladygaga",
        "tcId": "14230524"
      },
      "wikipedia": {
        "extract": "Stefani Joanne Angelina Germanotta (/ˈstɛfəniː dʒɜrməˈnɒtə/ STEF-ə-nee jur-mə-NOT-ə; born March 28, 1986), better known by her stage name Lady Gaga, is an American singer and songwriter. She initially performed in theater, appearing in high school plays, and studied at CAP21 through New York University's Tisch School of the Arts before dropping out to pursue a musical career. After leaving a rock band, participating in the Lower East Side's avant garde performance art circuit, and being dropped from a contract with Def Jam Recordings, Gaga worked as a songwriter for Sony/ATV Music Publishing. There, Akon noticed her vocal abilities and helped her to sign a joint deal with Interscope Records and his own KonLive Distribution.\nGaga rose to prominence with her debut album The Fame (2008), a critical and commercial success which produced global chart-topping singles such as \"Just Dance\" and \"Poker Face\". A follow-up EP, The Fame Monster (2009), was met with a similar reception and released the successful singles \"Bad Romance\", \"Telephone\", and \"Alejandro\". Her second full-length album Born This Way was released in 2011, topping the charts in more than 20 countries, including the United States, where it sold over one million copies in its first week. The album produced number one single \"Born This Way\". Her third album Artpop, released in 2013, topped the US charts and included the successful singles \"Applause\" and \"Do What U Want\". In 2014, Gaga released a collaborative jazz album with Tony Bennett titled Cheek to Cheek, which debuted at number one in the United States and became her third consecutive number one album in the country.\nGaga is noted for her flamboyant and diverse contributions to the music industry via her fashion, live performances, and music videos. With global album and single sales of 27 million and 125 million respectively, as of June 2014, she is one of the best-selling musicians of all time. Her achievements include six Grammy Awards, 13 MTV Video Music Awards, and 13 Guinness World Records. She regularly appears on Billboard's Artists of the Year lists and Forbes's power and earnings rankings, and was named one of the world's most influential people by Time in 2010. In the same year, Billboard named her the Artist of the Year. Outside of her music, she is noted for her philanthropic endeavors and activism for LGBT rights."
      }
    }
  ]
}